project06_2/app/controllers/admin/games_controller.rb

  def index
    ratings
    @games = Game.paginate :per_page => 10, :page => params[:page]
---
SELECT * FROM "games" LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "games"

  def show
    ratings
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def create
    ratings
    @user = current_user
    @game = Game.new(params[:game])
    @game.user_id = @user.id
    if @game.save
---
INSERT INTO "games" ("rating", "created_at", "title", "updated_at", "user_id") VALUES(4, '2011-03-10 00:09:17', 'COD 12', '2011-03-10 00:09:17', NULL)

  def edit
    ratings
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def update
    ratings
    @game = Game.find(params[:id])
    if @game.update_attributes(params[:game])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)
UPDATE "games" SET "updated_at" = '2011-03-10 00:09:02', "rating" = 4 WHERE "id" = 1