project06_2/app/controllers/admin/roles_controller.rb

  def index
    @roles = Role.paginate :per_page => 10, :page => params[:page]
---
SELECT * FROM "roles" LIMIT 10 OFFSET 0

  def show
    @role = Role.find(params[:id])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 5)

  def edit
    @role = Role.find(params[:id])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 17)

  def destroy
    @role = Role.find(params[:id])
    @role.destroy
---
SELECT * FROM "roles" WHERE ("roles"."id" = 6)
DELETE FROM "roles" WHERE "id" = 6