project06_2/app/controllers/admin/users_controller.rb

SELECT * FROM "users" LIMIT 10 OFFSET 0
---
  def index
    @users = User.paginate :per_page => 10, :page => params[:page]

SELECT * FROM "users" WHERE ("users"."id" = '3') LIMIT 1
---
  def show
    @user = User.find(params[:id])