project06_2/app/controllers/games_controller.rb

  def index
    ratings
    @games = Game.paginate :per_page => 10, :page => params[:page]
---
SELECT * FROM "games" LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "games"

  def show
    ratings
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)