project06_2/app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def index
    @users = User.all

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "role_id", "password_salt", "persistence_token", "last_name", "last_login_at", "first_name", "email") VALUES('2011-03-11 03:40:09', '140d58d8fe35e0584a3ed2a621112d504a28c594ead39218fb6f89ff26a64bf012fc35f3e6e396f47b87b2e201ef5f09feaa75aa7b892dee1b47f9f0ccf0a10b', '2011-03-11 03:40:09', 'cmckenna', NULL, 'FFAxkEZIDZ6gQVucmfji', '81a1297bc2633a2f57abe194b881aab676a2dc172ecd7a68d255fccfe1dc37a09203a7095536b45cdf1957c81d1bade2b53e9ed2bd1c14d4af982d422b5ac1fe', 'McKenna', NULL, 'Chad', 'cmckenna@mines.edu')
---
  def create
    @user = User.new(params[:user])
    if @user.save