project04/app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT * FROM "articles"

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def edit
    set_edit_return_url
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("created_at", "title", "author", "body", "creation_date", "updated_at", "num_edits") VALUES('2011-02-07 08:48:23', 'Article 2', 'Chad McKenna', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aenean et orci ante. Donec urna arcu, ullamcorper ac congue sed, sagittis venenatis sem. Curabitur vestibulum quam in sapien tristique tincidunt id a urna. Vivamus elit tortor, porta sed placerat quis, molestie venenatis erat. Integer suscipit ultrices arcu, sit amet ultricies nisi iaculis nec. Praesent rhoncus nunc sed dolor iaculis quis rhoncus ante condimentum. Phasellus ornare est ac quam auctor tempus. Maecenas eget elit euismod nisi tempor tincidunt id sed risus. Nam egestas ultricies nulla, quis posuere magna laoreet scelerisque. Curabitur vel enim libero, sit amet cursus nulla. Aliquam a turpis vitae magna sagittis molestie at eget neque. Proin id massa diam, a molestie urna.

  def update
    @article = Article.find(params[:id])

    if @article.num_edits.nil?
      @article.num_edits = 0
    end
    @article.num_edits += 1

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "updated_at" = '2011-02-07 06:37:20', "body" = 'Four score and seven years ago... (this isn''t truncated)' WHERE "id" = 3

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT * FROM "articles" WHERE ("articles"."id" = 7)
DELETE FROM "articles" WHERE "id" = 7