project06/app/controllers/games_controller.rb

SELECT * FROM "games" LIMIT 10 OFFSET 0
---
  def index
    @games = Game.paginate :per_page => 10, :page => params[:page]

INSERT INTO "games" ("rating", "created_at", "title", "updated_at", "user_id") VALUES('Awesome', '2011-02-27 23:58:05', 'Game', '2011-02-27 23:58:05', 1)
---
  def create
    #@game = Game.new(params[:game])
    if @game.save