project06/app/controllers/roles_controller.rb

SELECT * FROM "roles"
---
  def index
    @roles = Role.all

INSERT INTO "roles" ("created_at", "updated_at", "user_id", "role_name") VALUES('2011-03-06 23:11:15', '2011-03-06 23:11:15', NULL, 'Admin')
---
  def create
    #@role = Role.new(params[:role])
    if @role.save