project06/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    #@user.role_id = Role.find_by_role_name('Member').id
    if verify_recaptcha :private_key => '6LdfOMISAAAAAIYcN8ELzwjNPagy8uGW2-dIgdsC' && @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "role_id", "password_salt", "persistence_token", "last_name", "last_login_at", "first_name", "email") VALUES('2011-02-28 00:43:48', 'a0947fea72b208c49e8b8cc713bfb8da22bcbaf072fcad048dbd60a89a2f5532f1b763509df111cf9f5aeed3bfc637c6ff2d41c0b790dacb505bc4ff13a755e5', '2011-02-28 00:43:48', 'cmckenna', 1, '8kVa1rwW9MmBCFD3RTNd', 'b62cbbaa12d9670542a1ea9b15d7c17ecbf88980d1b3a6a3189c1f3ad495fcc6865ce14ae532e8e81508e84ec91606e1a89f4b4c86c91c3658026f6e9592e25e', 'McKenna', NULL, 'Chad', 'cmckenna@mines.edu')

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2011-02-28 05:15:08', "first_name" = 'Chadwick' WHERE "id" = 1

  def load_roles
    @roles = Role.all
---
SELECT * FROM "roles"