project06_2/app/controllers/members/games_controller.rb

SELECT * FROM "games" WHERE ("games"."user_id" = 4) LIMIT 1
---
  def index
    ratings
    @user = current_user
    @games = Game.find_all_by_user_id(@user.id)

SELECT * FROM "games" WHERE ("games"."id" = 2)
---
  def show
    ratings
    @game = Game.find(params[:id])

INSERT INTO "games" ("rating", "created_at", "title", "updated_at", "user_id") VALUES(1, '2011-03-09 20:22:01', 'Test Game', '2011-03-09 20:22:01', NULL)
---
  def create
    ratings
    @user = current_user
    @game = Game.new(params[:game])
    @game.user_id = @user.id
    if @game.save

SELECT * FROM "games" WHERE ("games"."id" = 2)
---
  def edit
    ratings
    @game = Game.find(params[:id])

SELECT * FROM "games" WHERE ("games"."id" = 2)
---
  def update
    ratings
    @game = Game.find(params[:id])