project06_2/app/controllers/members/games_controller.rb

SELECT * FROM "games"
---
  def index
    @games = Game.all