project06_2/app/controllers/members/users_controller.rb

UPDATE "users" SET "updated_at" = '2011-03-09 22:57:38', "email" = 'member1@gamez.com' WHERE "id" = 4
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])